{"pages":[{"title":"about","text":"这是关于界面暂时还没有文字….有待添加…","link":"/about/index.html"}],"posts":[{"title":"上年回顾与2022年规划","text":"&emsp;&emsp;今天恰好有些许空闲时间，就欲写点东西。思来想去，觉得有必要写一篇年度总结报告，以便自己制定今年的任务目标行程。设定一些任务目标，可以更好地指导自己去做事情，同时也可以提高效率，减少迷茫的时间。因为我怕我自己在日常生活会忘记了自己要干什么，尤其是在没有他人监督和提醒下，很容易在学习中懈怠、 偷懒，进而出现沉迷玩乐、荒废学业的不好结果。相反地，有了目标行程，当自己出现迷茫、疲倦、消极时，再看一看自己之前写的计划表，就又充满了干劲，知道自己在规定时间内需要做些什么。 一、回顾&emsp;&emsp;在上一年——也就是大一下学期和大二上学期这段时间中，其实我也没有什么太大的收获，总体而言，感觉是在混日子一样，可圈可点的，还真没有。(叹气) &emsp;&emsp;在大一的上个学期时，我就给自己定下了几个简单的指标，或者是硬性要求。其实也不过是在给自己划红线，以防自己忘掉初心&nbsp;1罢了。因为在进入大学的暑假，我就听学长学姐说**&nbsp;挂科、沉迷玩乐而荒废学业**等不好的例子了。所以在进入大学时，我就暗暗地告诫自己：自己切不可变成那样子的人，来大学是为了学习而来的，不是为了享乐而来的。如果这般，恐怕就是浪费自己的宝贵年华，自己高中时付出的辛勤汗水也将付之东流了。——这是我不愿意看到的，所以我为了更好约束自己，决定每个学期伊始，都制定一个简单概括性的规划表格，以警示自己不忘初心。 注1：尽量在大学中学有所得，不能虚度光阴 大一规划 不挂科 争取考过英语四级 不松懈，不能随波逐流，最起码要学点东西，比如语言方言学、计算机编程 学习上，达到转专业要求，尽力为之 迷茫时，请想想自己的家人、想想自己 &emsp;&emsp;那时的我，深知自己自制力、执行力并没有多强，故所制定规划时，也只是明确大概方向以及规定三五个硬性指标而已。现在回想起来，确实很有自知之明呢。因为我也不过是一名很普通很普通的普通人，并没有多优秀，承认自己的平庸，或许就是对自己的最大激励。 学业上 &emsp;&emsp;我并没有比其他人有多勤奋，对自己学的专业课程&nbsp;2，提不起多大的兴趣。每天去教室上课，自己总是处于一种迷迷糊糊的状态中，老师讲的知识，感觉自己实在没有听懂多少，有点愧对老师和自己了。尽管学习方面，并没有多用心，但在作业、考核方面还算是中规中矩，没有很偷懒。 注2：我之前是管理相关专业的。大一时上的专业基础课程 每每到学期临近结束时，我就有很强的危机感，所以我会提前一个月去复习相关课程，以降低自己挂科的可能性。其实，这种做法，姑且不论其效率、掌握多少，实际这是求心安。某种程度上来说，这算是亡羊补牢吧(叹息) 所谓的危机感就是：非常害怕自己挂科，尤其是想起自己对所学的课程内容丝毫记不起来时，莫名地害怕和懊恼。害怕的是，自己一个学期学下来，竟然分毫都没有学会，这样子下去的话，期考我就完蛋了；懊恼的是，一个学期这么久，自己都没有主动去整理笔记，也没有去复习过，我都在干什么呀！？一点学生的样子都没有了，简直是荒唐、匪夷所思！！ &emsp;&emsp;于是在自己的一番补救下，大一整个学年的学业总算是有惊无险地度过了，没有挂科，平均分也达到了自己的预期目标。庆幸自己还有忧患意识，不然挂科的机率恐怕是很大的。如今，我可不会像大一时那般地胆大了，做笔记、 经常性的复习还是要有的，绝不能太过松懈了。 日常生活 &emsp;&emsp;其实我这个人无趣的很，嗯~这是我对自己的评价，与人交流方面，可谓寥寥无几，而我也不擅长聊天啥的……久而久之，我就喜欢待在一个地方，做自己喜欢做的事情，比如看小说呀、听歌看动漫呀、逛逛编程方面的网站呀、语言学方言学方面的东西我也会关注。其实，这些兴趣，确是兴趣而已，到底没有一个算非常喜欢，故都是止步于了解这一层面而已，深一点的东西我就不懂了，也没有欲望去学习……所以这些兴趣爱好仅仅是我用来打发时间的消遣罢了。所以，社交人际方面，我是原地踏步的，没有一点进步，不过这也问题不大。 &emsp;&emsp;在日常消费方面，大多数都用购置书籍、氪金了，其他方面消费可谓是少之又少，不过这也谈不上缺点吧。在我潜意识中，勤俭节约、不过度消费是我一直坚守的观念，以至于每每消费时都要算一算…..我觉得这节约的习惯得一直保持下去才行，哪怕富贵与贫贱。 &emsp;&emsp;在兴趣方面&nbsp;看小说、听歌看动漫、编程、日语、音韵学方言学，正如前面所说言，我都没有一种擅长的，说来真惭愧&nbsp;3，我看别人都有一技之长，比如画画呀、唱歌呀、弹琴呀之类的，着实让我羡慕钦佩的很呐。在大一下学期暑假，我入门了RIME输入法&nbsp;4，在花费了两个月的时间，我完成了我家乡话的编码——就是制作一个带有汉字和方言拼音的汉字表格（&nbsp;简称字表、码表），它的格式大抵如下： 1234这 ze #前面为汉字，后面的拼音为客家方言拼音；只有这样子的格式，才能被输入法引擎检索识别是 si方 fong言 nzie 输入法粗略运作原理：依照这种格式制作出来的字表，导入RIME输入法后，就能被输入法引擎检索得到；当你输入相应的拼音时，屏幕上就会显示出相应汉字，以供用户选择。——这就是中文输入法运作的基本原理。而拼音数据，则需要人工制作，机器并不能推出哪个汉字的具体读音，更不用说同一个汉字多个读音这种情况了目前汉字信息处理这方面，并没有很好的解决办法，大多数智能输入法，如搜狗拼音输入法、百度输入法等，都是依靠硬编码的，只不过它们在智能联想、智能检索等方面做了很大改进，极大增强了用户良好体验。硬编码，就是给机器一个字典，机器可以依照这个字典正常工作。 &emsp;&emsp;之后，我又制作了一个TRIME输入法(安卓版RIME输入法)的客家方言12键布局。经过我半年的折腾，终于实现了在电脑、手机端上用客家方言拼音进行打字了！！——耗费了我很多精力时间在其中，不过还是有收获的，这也算值得了。 查看客家方言12键布局图像 &emsp;&emsp;制作方言输入法方案和设计键盘布局，恐怕是我做得最有意义的一件事情了吧！？ &emsp;&emsp;之后，我又自学了一点Adobe Premiere剪辑技术。因为我一直想做一个客家方言教程，只是自己水平有限，故迟迟没有付诸实践…..但在制作了方言输入方案之后，我深觉客家方言教程非常必要，终于下定决心去写一写了。于是我磨了两天才把PPT做出来，然后又录制了视频，再花了一个晚上加字幕和合成视频。 &emsp;&emsp;这是我做的第二件有意义的事情。 注3：真的，就是初学者，而且是一知半解的那种；三分热度罢了，开始觉得有趣，就多了解点，而后热度就减低了。 注4：这是一款可以自定义输入方案、定制键盘等的可组装性极高的输入法，支持方言拼音输入等。","link":"/2022/0268fb945d.html"},{"title":"2021年冬・日记","text":"&emsp;&emsp;周末甚繁忙于英语课程，总无所脱手。所谓忙中偷闲，莫过于此也。若问有何收获，答曰「勤学则有获，怠习则懒慢。每有计画、欲成二三，心力总不足。而今，能成一二，吾之幸也」。 ​ &emsp;&emsp;除忙于外语，賸余时间则志于学业。虽偶有松怠。平淡度日，亦也足吾心。平平淡淡，正系真也。无他烦忧于吾身，能专于己。 &emsp;&emsp;现已秋，光阴如箭矢。天愈冷，景致也愈清。 &emsp;&emsp;如非必要，切切无出外。于字书，于方音，吾总迷于其中而不得自拔。初触音韵，盖高中时期也。彼时，试读王力之音韵书、郑张尚芳之上古汉语、郭锡良之切韵手册，感音韵之奇妙，始识中国语之音韵奥秘，始知古人言语与今言语之有异，而觉古音韵律之绝响，久久无能释怀。尝挑灯夜读于寝室，以饱己求知欲。亦系自彼，叩开往音韵之门，通向更深处也。 ​ &emsp;&emsp;吾一乡下人，无甚通识，无甚能才，仅欲借音韵之手，而熟己方音，以我方音就文章，传文承德而已也。吾冀乡亲中者，有同志同道之人，携手流布方音之传承切要性也。倘若无，仍无妨，独者先行，今后有日，定有识者赏也。 &emsp;&emsp;今乡下，多无识己方音者。然，自方音断绝于学堂后，方音就诗书者，自然也失传也。此现象，老者先生归屋后，愈发严重。传承之说，少有人提及，故后生无识，不应加多苛责也。 &emsp;&emsp;无识即无识，又何能改之也乎。每念及此，二三感叹罢矣。吾一介人之力，无能变之。 &emsp;&emsp;今下外边，仍细雨飘飘，冷风萧萧。适时从学堂转，闲笔四五句罢矣。 &emsp;&emsp;随惗随书，无甚章法，仅抒己情也。 记于旧历九月廿五日&lt;/br/&gt;下昼五时过半","link":"/2022/024a17b156.html"}],"tags":[{"name":"规划","slug":"规划","link":"/tags/%E8%A7%84%E5%88%92/"},{"name":"日常","slug":"日常","link":"/tags/%E6%97%A5%E5%B8%B8/"}],"categories":[{"name":"日常生活","slug":"日常生活","link":"/categories/%E6%97%A5%E5%B8%B8%E7%94%9F%E6%B4%BB/"},{"name":"日常","slug":"日常","link":"/categories/%E6%97%A5%E5%B8%B8/"}]}